app/Controllers/Datatables.php

SELECT `username`, `userfullname`, `userphonenumber`, `useraddress`, `userlevel`, `created_at`
FROM `tb_user`
WHERE `userlevel` < '3'
---
    public function tableKaryawan()
    {
        $dataKaryawan["data"] = "";
        $session = \Config\Services::session();
        $level = $session->get('level');
        if ($level == 0) {
            $dataKaryawan = $this->user
            ->select('username, userfullname, userphonenumber, useraddress, userlevel ,created_at')
            ->where('userlevel <', '3')
            ->findAll();

SELECT `username`, `userfullname`, `userphonenumber`, `useraddress`, `userlevel`, `created_at`
FROM `tb_user`
WHERE `userlevel` = '3'
---
    public function tableClient()
    {
        $dataClient["data"] = "";
        $dataClient = $this->user
        ->select('username, userfullname, userphonenumber, useraddress, userlevel ,created_at')
        ->where('userlevel', '3')
        ->findAll();